; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite6 - satellite
	instrument16 - instrument
	instrument17 - instrument
	spectrograph0 - mode
	thermograph4 - mode
	infrared3 - mode
	infrared2 - mode
	thermograph1 - mode
	thermograph5 - mode
	GroundStation4 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph5)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared2)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph4)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph5)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 thermograph4)
	(supports instrument7 thermograph5)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument10 thermograph5)
	(supports instrument10 thermograph1)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 thermograph5)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star3)
	(supports instrument12 infrared2)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument13 thermograph1)
	(supports instrument13 infrared3)
	(supports instrument13 spectrograph0)
	(calibration_target instrument13 GroundStation4)
	(supports instrument14 infrared2)
	(supports instrument14 thermograph4)
	(calibration_target instrument14 GroundStation1)
	(supports instrument15 spectrograph0)
	(calibration_target instrument15 Star3)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(on_board instrument15 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
	(supports instrument16 thermograph1)
	(supports instrument16 thermograph4)
	(calibration_target instrument16 GroundStation0)
	(supports instrument17 thermograph4)
	(supports instrument17 spectrograph0)
	(supports instrument17 thermograph1)
	(calibration_target instrument17 GroundStation2)
	(on_board instrument16 satellite6)
	(on_board instrument17 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star7)
)
(:goal (and
	(pointing satellite1 GroundStation4)
	(have_image Phenomenon5 thermograph4)
	(have_image Planet6 infrared3)
	(have_image Star7 infrared3)
	(have_image Planet8 thermograph1)
	(have_image Planet8 infrared3)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon9 thermograph4)
))

)

; plan
1. (turn_to satellite5 groundstation4 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument13 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument13)
   goals met: 0 of 8
3. (calibrate satellite5 instrument13 groundstation4)
   added: (calibrated instrument13)
   goals met: 0 of 8
4. (turn_to satellite5 planet8 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 planet8)
   goals met: 0 of 8
5. (take_image satellite5 planet8 instrument13 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 1 of 8
6. (take_image satellite5 planet8 instrument13 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 2 of 8
7. (turn_to satellite5 planet6 planet8)
   deleted: (pointing satellite5 planet8)
   added: (pointing satellite5 planet6)
   goals met: 2 of 8
8. (turn_to satellite1 groundstation4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation4)
   goals met: 3 of 8
9. (turn_to satellite0 groundstation2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 8
10. (take_image satellite5 planet6 instrument13 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 4 of 8
11. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 8
12. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 4 of 8
13. (turn_to satellite0 phenomenon5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 8
14. (take_image satellite0 phenomenon5 instrument2 thermograph4)
   added: (have_image phenomenon5 thermograph4)
   goals met: 5 of 8
15. (turn_to satellite0 phenomenon9 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 8
16. (take_image satellite0 phenomenon9 instrument2 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 6 of 8
17. (take_image satellite0 phenomenon9 instrument2 thermograph4)
   added: (have_image phenomenon9 thermograph4)
   goals met: 7 of 8
18. (turn_to satellite0 star7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star7)
   goals met: 7 of 8
19. (take_image satellite0 star7 instrument2 infrared3)
   added: (have_image star7 infrared3)
   goals met: 8 of 8
